---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.RunsNumber
source: html/617b93a9-f92f-017d-ffe8-bc21516c3330.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.RunsNumber Property

The Runs Number of the Electrical System.

## Syntax (C#)
```csharp
public int RunsNumber { get; }
```

## Remarks
This property is used to retrieve the Runs Number of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!